Revit 2026 API

# FillGrid(FillGrid) Constructor

---

Constructs a new FillGrid with default settings.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FillGrid(
	FillGrid other
)
```
```vb
Public Sub New (
	other As FillGrid
)
```
```cpp
public:
FillGrid(
	FillGrid^ other
)
```
```fsharp
new :
        other : FillGrid -> FillGrid
```

#### Parameters

other FillGrid

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

FillGrid Class

FillGrid Overload

Autodesk.Revit.DB Namespace